modules/integration/tests-integration/src/test/resources/windows/enrollment/ms_xcep.xml

<s:Envelope
xmlns:s="http://www.w3.org/2003/05/soap-envelope"
xmlns:a="http://www.w3.org/2005/08/addressing"
xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512"
xmlns:ac="http://schemas.xmlsoap.org/ws/2006/12/authorization">
<s:Header>
    <a:Action
            s:mustUnderstand="1">
        http://schemas.microsoft.com/windows/pki/2009/01/enrollmentpolicy/IPolicy/GetPolicies
    </a:Action>
    <a:MessageID>
        urn:uuid:72048B64-0F19-448F-8C2E-B4C661860AA0
    </a:MessageID>
    <a:ReplyTo>
        <a:Address>
            http://www.w3.org/2005/08/addressing/anonymous
        </a:Address>
    </a:ReplyTo>
    <a:To
            s:mustUnderstand="1">
        https://EnterpriseEnrollment.wso2.com/ENROLLMENTSERVER/PolicyEnrollmentWebservice.svc
    </a:To>
    <wsse:Security
            s:mustUnderstand="1">
        <wsse:BinarySecurityToken
                ValueType="http://schemas.microsoft.com/5.0.0.0/ConfigurationManager/Enrollment/DeviceEnrollmentUserToken"
                EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd#base64binary">
            {BinarySecurityToken}
        </wsse:BinarySecurityToken>
    </wsse:Security>
</s:Header>
<s:Body
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <GetPolicies
            xmlns="http://schemas.microsoft.com/windows/pki/2009/01/enrollmentpolicy">
        <client>
            <lastUpdate
                    xsi:nil="true"/>
            <preferredLanguage
                    xsi:nil="true"/>
        </client>
        <requestFilter
                xsi:nil="true"/>
    </GetPolicies>
</s:Body>
</s:Envelope>